In [10]:
import pandas as pd

In [11]:

friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [12]:
df2=df.drop('age', axis=1)

In [13]:
df2

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

In [14]:
df3=df.drop('age', axis=0)

ValueError: labels ['age'] not contained in axis

In [15]:
df['salary'] = 0

In [16]:
df

   age        job   name  salary
0   20    student   Jone       0
1   30  developer  Jenny       0
2   30    teacher   Nate       0

In [17]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student' , 'yes', 'no')

In [18]:
df

   age        job   name salary
0   20    student   Jone     no
1   30  developer  Jenny    yes
2   30    teacher   Nate    yes

In [19]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [20]:
df['total'] = df['midterm'] + df['final']

In [21]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [22]:
df['average'] = df['total'] / 2

In [23]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [24]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [25]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [26]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

In [27]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [28]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [29]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [30]:
def extract_year(row):
    return row.split('-')[0]

In [31]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [32]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [33]:
df.drop('yyyy-mm-dd', axis=1)

   year
0  2000
1  2002
2  2005

In [34]:
def extract_year(year, current_year):
    return current_year - int(year)

In [35]:
df['age'] = df['year'].apply(extract_year, current_year=2018)

In [36]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [42]:
def get_introduce(age):
    return ("I am " + str(age) + " years old.")

In [ ]:
df['introduce'] = df['age'].apply(get_introduce)